"""
长线趋势

市场整体向上或向下运行，一般（并非总是）持续一年以上，甚至时间可能长达数年

牛市 bull market
每一波连续的上涨达到一个新的高度，且每一次回调的低点都高于前一次回调的低点
Phase1
建仓期，有远见的投资者嗅到了经济向好的气息，逐步建仓，普通民众对股市毫无兴趣，交投清淡，但是随着市场回暖，成交量开始增加
Phase2 
随着公司业绩改善，营收持续增长，民众开始关注股市
市场稳步上涨，交投日益增长
Phase3
民众大批涌入股市，交易活动频繁，投机猖獗，成交量持续放大，但股价跳水频繁出现，垃圾股被炒上天，绩优股则大多落后大盘

熊市 bear market
每一波下跌达到一个新的低点，且每次反弹的高点都低于前一次反弹的高点
Phase1
出货期，出现于上一轮牛市的末尾
宗庙的投资者察觉到企业营收高的不正常，于是加快出货
此刻交易量仍然很高，但随着每一轮价格上涨交易量逐渐减少
民众仍然热情高涨，但随着获利越来越难，不少人开始沮丧
Phase2
恐慌期，买盘越来越少，卖盘越来越急
股价几乎是垂直下跌，然而成交放出天量
恐慌期过后，市场会经历较长时间的修复或横盘走势，然后进入P3
Phase3
灰心的投资者开始抛售股票
消息面开始恶化
一些投资者割肉抛售，筹集现金作为他用，整个市场会持续下跌
垃圾股泡沫彻底破灭，而绩优股的下跌则相对较慢

任何预示着趋势改变的有效信号都无法单独由某一个指数发出


当价格随着长线趋势变动时，交投趋于活跃
在牛市中，价格上升时成交量放大，价格回落时成交量缩小
熊市中，价格下降时成交量放大，价格回升时成交量缩小
"""